---
type: ExportLineweightInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ExportLineweightInfo

`Autodesk.Revit.DB.ExportLineweightInfo` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportLineweightInfo | — | `` |
| Constructor | ExportLineweightInfo | 2014 | `public ExportLineweightInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | DestinationLineweightName | 2014 | `public string DestinationLineweightName { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |